'''
Задача No21. Решение в группах
Напишите программу для печати всех уникальных значений в словаре.

Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}]
Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

Примечание: 
Список словарей задан изначально. Пользователь его не вводит
'''

a = [{"V": "S001"},
     {"V": "S002"},
     {"VI": "S001"},
     {"VI": "S005"},
     {"VII": " S005 "}, 
     {" V ":" S009 "}, 
     {" VIII":" S007 "}]

b = set()

# 1 вариант решения

# for i in a:
#     for j in i.values():
#         b.add(j.strip())
# print(b)

# 2 вариант решения

for i in a:
    b.add(str(*i.values()).strip())

print(b)